; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-5)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(free left)
(free right)
(at ball1 rooma)
(at ball2 room3)
(at ball3 room4)
(at ball4 room4)
(at ball5 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
)
)
)

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 2 of 5
2. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 2 of 5
3. (pick ball5 room5 right)
   deleted: (at ball5 room5) (free right)
   added: (carry ball5 right)
   goals met: 2 of 5
4. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 2 of 5
5. (drop ball5 room4 right)
   deleted: (carry ball5 right)
   added: (at ball5 room4) (free right)
   goals met: 3 of 5
6. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 4 of 5
7. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 4 of 5
8. (pick ball2 room3 left)
   deleted: (at ball2 room3) (free left)
   added: (carry ball2 left)
   goals met: 4 of 5
9. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 4 of 5
10. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 5 of 5
